-----
Product ID: 460
Name: None
Description: These compression fabric sports leggings are a must for medium to high-intensity workouts. They're soft, comfy, and chic—ideal for anyone who enjoys an active lifestyle.

• Fabric composition in Mexico: 75% polyester, 25% lycra (upper part of the leggings) and 75% polyester, 25% spandex (bottom part of the leggings)
• Fabric composition in Europe: 57% polyamide, 43% spandex (upper part of the leggings) and 78% polyester, 22% spandex (bottom part of the leggings)
• Upper part fabric weight: 5.45 oz/yd² (185 g/m²)
• Bottom part fabric weight: 8.25 oz/yd² (280 g/m²)
• Compression fabric
• Non-see-through and squat-proof
• Sewn-in gusset
• ⅞ length
• High-waisted
• Slimming effect and a butt-lifting cut
• Double-layered belt
• Size up if you’re between sizes as compression fabric can be tight on the body
• Pocket in the back part of the belt suitable for top phone models, eg. iPhone 12
• Blank product components sourced from Italy and Spain
-----
Product ID: 671
Name: None
Description: Get a personalized and sports water bottle made from 50% recycled plastic to stay hydrated in style. Resistant to stains, shattering, and odors, it keeps your drinks fresh, and the spill-proof lid and bite valve prevent leaks. This bottle’s extra large size is also suitable for any long gym, work, or study sessions!

• 25 oz (739 ml)
• Dimensions: 10″ × 3″ (25.4 × 7.62 cm)
• BPA-free Eastman Tritan™ Renew 50% recycled material
• Stain, shatter, and odor-resistant
• Spill-proof screw-on lid with bite valve
• Single-finger carry-handle
-----
Product ID: 93
Name: None
Description: Expand your wardrobe with a classic embroidered beanie. Finished with a pom-pom on top, it offers tons of warmth and comfort, and is destined to find its way into all your favorite cold-weather looks.

• 100% acrylic
• 12″ (30.5 cm) knit
• Fold-over 3″ (7.6 cm) cuff
• Pom-pom on top
• One size fits most
• Blank product sourced from Vietnam
-----
Product ID: 480
Name: None
Description: Bring fun and color to your wardrobe with this 100% cotton tie dye hat. It's stylish, super trendy, and will add extra pizzazz to any outfit.

• 100% cotton
• Unstructured, 6-panel, low profile
• Pre-curved visor
• Tri-glide buckle closure
• One size fits most
• Head circumference: 20½″–24½″ (52 cm–62 cm)
-----
Product ID: 585
Name: None
Description: Enjoy hot or cold drinks on the go with this stylish stainless steel tumbler! This reusable tumbler with a metal straw is a perfect combo for hot or cold drinks at any time of the day.

• High-grade stainless steel tumbler
• 20 oz (600 ml)
• Tumbler size: 3.11″ × 8.42″ (7.9 cm × 21.4 cm)
• Straw and lid included with the tumbler
• A cylindrical shape (top to bottom)

Disclaimer: Not dishwasher or microwave safe. Hand-wash only.
-----
Product ID: 382
Name: None
Description: This 17-ounce, double-walled stainless steel water bottle is perfect for your daily outings. It will keep your drink of choice hot or cold for hours. It also features an odor- and leak-proof cap. Throw it in your 
car's cup holder on your way to work, take it with you on hikes, or toss it in your bag for any time you get thirsty.

• High-grade stainless steel
• 17 oz (500 ml)
• Dimensions: 10.5″ × 2.85″ (27 × 7 cm)
• Vacuum flask
• Double-wall construction
• Bowling pin shape
• Glossy finish
• Odorless and leak-proof cap
• Insulated for hot and cold liquids (keeps the liquid hot or cold for 6 h)
• Patented ORCA coating for vibrant colors
• Hand-wash only
• Blank product sourced from China

Disclaimer: Keeping water in the bottle for over 24 hours is unhygienic and can result in an unpleasant smell.
-----
Product ID: 433
Name: None
Description: These postcards are made from thick high-quality matte paper, so they serve as a great addition to a gift or just a thoughtful written note to a friend.
• Cardboard paper
• Paper weight: 7.67–10.32 oz/yd² (260–350 g/m²)
• Size: 4″ × 6″ (101 × 152 mm)
• Paper thickness: 0.013″ (0.34 mm)
• Coated outer surface
• Blank product materials sourced from Sweden, US, Brazil, or China
-----
Product ID: 691
Name: None
Description: From bachelor and bachelorette parties to weddings, baby showers, and intimate dinner parties, this glass effortlessly elevates any occasion. Indulge in the perfect balance of style and functionality, raise a glass to unforgettable moments and celebrate life’s moments.

• Glass material
• Simple and sleek design
• Volume: 15 oz (443 ml)
• Not dishwasher or microwave safe
• Blank product sourced from the US
-----
Product ID: 711
Name: None
Description: This exquisite sherpa blanket combines a plushie feel with exceptional softness, making it the ultimate comfort companion. Perfect for daily use while lounging on the couch, snuggling up on chilly evenings, or styling your room—this blanket offers unmatched coziness and warmth.

• Integral composition: 100% polyester fibers
• Fabric: 100% polyester (51.5% surface fabric, 48.5% sherpa fabric)
• Smooth side fabric: 6.49 oz/yd² (220g/m²), sherpa fabric: 7.08 oz/yd² (240g/m²)
• Blank product components in the US sourced from Columbia
• Blank product components in the EU sourced from China
-----
Product ID: 259
Name: None
Description: Give your bathroom a vibrant look and wrap yourself up with this super soft and cozy all-over sublimation towel.

• Fabric composition in the US: 52% cotton, 48% polyester
• Fabric composition in EU: 50% cotton, 50% polyester
• Fabric weight in the US: 10.6 oz./yd.² (360 g/m²)
• Fabric weight in EU: 11.8 oz./yd.² (400 g/m²)
• Size: 30″ × 60″ × 0.28″ (76 × 152 × 0.7 cm)
• Printed on one side only
• The non-printed side is made of terry fabric, making the towel more water-absorbent
• Blank product sourced from China
-----
Product ID: 359
Name: None
Description: Prepare for an adventurous and carefree summer with a pair of colorful slippers that are created just for you! The rubber sole is lined with a soft fabric to make sure you feel comfortable wherever your day takes 
you.

• Rubber sole
• Customizable 100% polyester fabric lining
• Black Y-shaped rubber straps
• Toe post style
-----
Product ID: 710
Name: None
Description: Crafted from resilient fabric, this table runner is both soft and enduring. Whether for everyday elegance or holiday charm, it will make meal times with loved ones a little more special. Treat yourself to this delightful table accessory or consider it as a thoughtful gift for someone special.

• 100% polyester
• Full coverage sublimation
• Size: 90″ × 16″ (229 cm × 41 cm)
• The reverse side is off-white
• Blank product sourced from China
-----
Product ID: 616
Name: None
Description: Style rooms with this slimmer-than-ever thin canvas! Order it and hang it straight away with built-in wall mounts and rubber pads on the back ready to protect against damage.
• 0.75″ (19.05 mm) thick canvas
• Canvas fabric weight: 10.15 +/- 0.74 oz/yd² (344 g/m² +/- 25g/m²)
• Wall mounts attached
• Rubber pads on the back to avoid damage
• Slimmer than regular canvases
-----
Product ID: 540
Name: None
Description: You can never go wrong with a classic bomber jacket, especially when it’s high quality and made of recycled materials. This versatile bomber jacket will complement most outfits and styles, and keep you warm during the chillier days.

• 100% recycled polyester
• Fabric weight: 5.5 oz/yd² (156 g/m²)
• Relaxed fit
• Unisex sizing
• Utility pocket on the sleeve
• Rib-knit banding at collar, cuffs, and hem
• Premium YKK zipper
• Blank product sourced from China
-----
Product ID: 437
Name: None
Description: Make a fashion statement with this iconic unisex denim jacket. Pair it with a t-shirt, hoodie, or a dress—it'll look great on any occasion.

• 99% ring-spun combed cotton, 1% spandex
• Fabric weight: 12 oz/yd² (407 g/m²)
• Chest pockets with buttons
• Blank product sourced from China
-----
Product ID: 550
Name: None
Description: If there’s an item that never goes out of style, it’s a leather jacket. Made of 100% PU leather, this classic piece will complement casual, chic, or sporty outfits.

•  Outside: 100% polyurethane (PU) leather
•  Lining: 60% cotton, 40% polyester
•  Embroidery backing: 100% rayon
•  Fabric weight: 10.6 oz/yd² (359 g/m²)
•  Regular fit
•  Rib-knit banding at collar, cuffs, and hem
•  Side pockets
•  Utility pocket on the sleeve
•  Hidden inside access zipper at the back of the design area
•  Blank product sourced from China
-----
Product ID: 395
Name: None
Description: Do you feel that your home is missing an eye-catching, yet practical design element? Solve this problem with a soft silk touch throw blanket that's ideal for lounging on the couch during chilly evenings.

• 100% polyester
• Soft silk touch fabric
• Printing on one side
• White reverse side
• Machine-washable
• Hypoallergenic
• Flame retardant
• Blank product sourced from China
-----
Product ID: 686
Name: None
Description: Make your phone look like a work of art with this tough-yet-sleek phone case. Made with impact-resistant and shock-absorbing materials, it’ll keep your phone safe from bumps and scratches. Plus, the dual-layer design offers extra durability and protection. It’s time to add some fun, protective flair to your phone!

• Outer shell: Polycarbonate (PC)
• Liner: Polyurethane (TPU)
• Precisely aligned port openings
• Induction charger compatible

Important: This product cannot be shipped to South Korea, Hong Kong, Taiwan, Japan, or Singapore. If your shipping address is in these regions, please choose a different product.
-----
Product ID: 601
Name: None
Description: Protect your phone with style using a durable, dual-layered case. The outer shell is made of impact-resistant polycarbonate, while the inner lining sports TPU lining for maximum impact absorption. Keep your phone 
fashionable and safe all year round!

• Polycarbonate outer shell
• Thermoplastic Polyurethane TPU inner liner
• Dual-layer protection
• Precisely aligned port openings
• Induction charging compatible
• Blank product sourced from Korea

Important: This product cannot be shipped to South Korea, Hong Kong, Taiwan, Japan or Singapore. If your shipping address is in these regions, please choose a different product.
-----
Product ID: 663
Name: None
Description: Sip in style and comfort with an elevated travel mug.  With its sleek and durable design, you’ll love taking this mug wherever you go. It fits into most car cup holders and has a spill-proof plastic lid. Commute to work or go on new adventures—this travel mug will keep your beverage safe and at just the right temperature.

• Made with stainless steel and BPA-free plastic
• Capacity: 25 oz (739 ml)
• Height: 7.9″ (20 cm)
• Upper diameter: 3.3″ (8.4 cm)
• Bottom diameter: 2.7″ (7 cm)
• Hand-wash only

Caution! To prevent steam pressure buildup, always open the lid before placing it on a hot drink.
-----
Product ID: 233
Name: None
Description: A stylish spin on the classic baseball raglan. The combed cotton blend makes it super soft, comfortable, and lightweight.

• All solid colors are 100% ring-spun cotton
• Heather Grey color is 90% cotton, 10% polyester
• Heather Denim color is 50% cotton, 50% polyester
• Fabric weight: 4.5 oz/yd² (152.6 g/m²)
• Fine knit jersey
• 30 singles
• ¾ sleeves
• Contrast raglan sleeve
• Unhemmed bottom
• Reactive-dyed for longer-lasting color
• Prewashed to minimize shrinkage
• Tear away label
• Blank product sourced from Mexico
-----
Product ID: 755
Name: None
Description: Elevate your performance and style with this classic dad hat from Under Armour®, designed for comfort and durability. The built-in HeatGear® sweatband wicks away moisture, making this hat ideal for hot summers and dynamic workouts.

• 65% polyester, 35% cotton
• Embroidered Under Armour® label on the left side
• Unstructured, 6-panel, low-profile
• Curved visor
• Adjustable cloth strap closure
• Blank product sourced from Vietnam
-----
Product ID: 765
Name: None
Description: Stay comfy and warm with this ultra-soft fleece hoodie. It features a relaxed fit for all-day comfort and is ideal for sports and casual wear.

• 80% cotton, 20% polyester
• Fabric weight: 8.11 oz./yd.² (275 g/m²)
• Soft cotton-blend fleece with brushed inside
• Unisex, regular fit
• Front pouch pocket
• Ribbed cuffs and bottom hem
• Matching drawstrings
• Embroidered Under Armour® logo at the top center
• Blank product sourced from Vietnam
-----
Product ID: 766
Name: None
Description: Designed for high performance, this shirt features anti-odor technology and breathable, light fabric to keep you cool. Whether for sports or casual wear, it’s a versatile choice.

• 100% polyester
• Fabric weight: 5.29 oz./yd.² (179 g/m²)
• Relaxed fit
• Anti-odor sweat-wicking material
• Textured, breathable fabric
• 3-button placket
• Self-fabric collar
• Under Armour® logo on the right chest
• Blank product sourced from Vietnam
-----
Product ID: 771
Name: None
Description: Designed for peak performance, this polo features anti-odor technology and breathable, lightweight fabric. Stay fresh and comfortable whether you're hitting the gym, running errands, or enjoying a casual outing.  

• 100% polyester
• Fabric weight: 5.29 oz./yd.² (179 g/m²)
• Relaxed fit
• Anti-odor sweat-wicking material
• Textured, breathable fabric
• 3-button placket
• Self-fabric collar
• Under Armour® logo on the right chest
• Blank product sourced from Vietnam
-----
Product ID: 613
Name: None
Description: This custom unisex zip hoodie has a brushed fleece inside, a hood with matching color drawstrings, and 2 handy kangaroo pockets. The comfortable fit and light fabric make it a must-have athleisure item.

• 50% ringspun cotton, 50% polyester
• Fabric weight: 7.67 oz/yd² (260 g/m²)
• Brushed fleece
• Regular fit
• Straight cut
• Tubular construction
• Ribbed bottom and cuffs
• Hood with matching color drawstrings
• 2 kangaroo pockets
• Set-in sleeves
• Full zip
• Blank product sourced from Pakistan

Disclaimer: US customers should order a size up as the EU sizes for this supplier correspond to a smaller size in the US market.
-----
Product ID: 438
Name: None
Description: The 100% cotton unisex classic tee will help you land a more structured look. It sits nicely, maintains sharp lines around the edges, and goes perfectly with layered streetwear outfits. Plus, it's extra trendy now!

 • 100% cotton
 • Sport Grey is 90% cotton, 10% polyester
 • Ash Grey is 99% cotton, 1% polyester
 • Heather colors are 50% cotton, 50% polyester
 • Fabric weight: 5.0–5.3 oz/yd² (170-180 g/m²)
 • Open-end yarn
 • Tubular fabric
 • Taped neck and shoulders
 • Double seam at sleeves and bottom hem
 • Blank product sourced from Honduras, Nicaragua, Haiti, Dominican Republic, Bangladesh, Mexico
-----
Product ID: 546
Name: None
Description: Be it the 90s or mid 2000s—a classic denim jacket never goes out of style, and now you don’t have to wait for the summer to roll around to wear one! This jacket is lined with wool-like sherpa fabric that’s comfortable to wear and will keep you warm and snug. The lining is made of 100% recycled materials, including plastic bottles.

•  Denim: 99% cotton, 1% spandex
•  Sherpa & sleeve lining: 100% recycled polyester
•  Fabric weight: 12 oz/yd² (406.9 g/m²)
•  Chest pockets with button flap closure
•  Two side pockets
•  Regular fit
•  Blank product sourced from China
-----
Product ID: 543
Name: None
Description: If there’s one fashion rule to live by, let it be that comfort doesn’t have to be compromised for the sake of style. Pair the super-soft unisex eco raglan hoodie with joggers for a relaxed look, or elevate the outfit with a skirt, oversized blazer, or classic trousers. The hoodie’s brushed inside ensures a comfy and snug feel, and will keep you warm during the colder days.

• Outside: 100% organic cotton
• Charcoal melange is 60% cotton, 40% recycled polyester
• Inside for all colors: 80% organic cotton, 20% recycled polyester
• Brushed lining
• Regular fit
• Raglan sleeves
• Ribbed cuffs and hem
• Drawstrings with metal eyelets and stoppers
• Jersey-lined hood
• Blank product sourced from Bangladesh
-----
Product ID: 493
Name: None
Description: Elevate your style with this unisex eco sweatshirt. The shirt has a chic, crisp look and will go great with both casual and more dressed up outfits. Made of organic cotton, this sweatshirt is durable, comfy, and extra soft.

• 100% organic ring-spun combed cotton
• Fabric weight: 350 g/m² (10.3 oz./yd.²)
• Regular fit
• Set-in sleeves
• 1×1 rib at neck collar, sleeve hem, and bottom hem
• Double-needle topstitch at the neck collar, on the sleeves, and on the bottom hems
• Inside herringbone back neck tape
• Self-fabric half moon at back neck
• Blank product sourced from Bangladesh

The sizes correspond to a smaller size in the US market, so US customers should order a size up.
-----
Product ID: 479
Name: None
Description: Thanks to its organic materials, the unisex essential eco hoodie is a great buy for eco-conscious fashion lovers. This comfortable regular fit hoodie has a double-layered hood, set-in sleeves, and a front pouch pocket.

• 100% organic cotton
• Fabric weight: 10.32 oz./yd.² (350 g/m²)
• Regular fit
• Set-in sleeves
• Self-fabric double-layered hood
• Front pouch pocket
• 1×1 rib at sleeve hem and bottom hem
• Single needle topstitch at neckline and along hood opening
• Metal eyelets
• Inside tape at the back of the neck
• Self-fabric half-moon at the back of the neck
• Download eco-friendly product certificates
• Blank product sourced from Bangladesh

The sizes correspond to a smaller size in the US market, so US customers should order a size up.
-----
Product ID: 753
Name: None
Description: Enjoy ultimate comfort with this unisex garment-dyed shirt, crafted from durable heavyweight fabric and dyed for a lived-in look. The dyeing technique ensures the shirt is pre-shrunk to maintain its shape no matter how many times you wash it.

• 100% soft ring-spun cotton
• Fabric weight: 6.1 oz./yd.² (206.8 g/m²)
• Relaxed fit
• Garment-dyed, pre-shrunk fabric
• Topstitched, classic width collar
• Twill-taped neck and shoulders for comfort and durability
• Rib cuffs
• Shoulder-to-shoulder twill tape
• Signature twill label
• Blank product sourced from Honduras
-----
Product ID: 586
Name: None
Description: If you’re looking for a thick, structured tee that’s also super soft and breathable—look no further! The unisex garment-dyed heavyweight t-shirt ticks all the boxes and is made of 100% ring-spun cotton. The regular t-shirt style will complement most looks and fit you to a tee.

• 100% ring-spun cotton
• Fabric weight: 6.1 oz/yd² (206.8 g/m²)
• Garment-dyed
• Relaxed fit
• 7/8″ double-needle topstitched collar
• Twill-taped neck and shoulders for extra durability
• Double-needle armhole, sleeve, and bottom hems
• Blank product sourced from Honduras
-----
Product ID: 456
Name: None
Description: Made from 100% organic ring-spun cotton, this unisex t-shirt is a total must-have. It's high-quality, super comfy, and best of all—eco-friendly.

• 100% organic ring-spun cotton
• Fabric weight: 5.3 oz./yd.² (180 g/m²)
• Single jersey
• Medium fit
• Set-in sleeves
• 1 × 1 rib at collar
• Wide double-needle topstitch on the sleeves and bottom hems
• Self-fabric neck tape (inside, back of the neck)
• Blank product sourced from Bangladesh

The sizes correspond to a smaller size in the US market, so US customers should order a size up.
-----
Product ID: 643
Name: None
Description: Treat yourself with 100% high-quality organic cotton. Each shirt is preshrunk to minimize shrinkage, but the fabric remains extra soft and durable. With tapered shoulders and a crew neck, it’ll work with almost every outfit! Grab one for yourself.

• 100% certified organic ring-spun cotton
• Fabric weight: 5.3 oz/yd² (180 g/m²)
• Regular fit
• Crew neck
• Twin needle stitch neck ribbing
• Side-seamed
• Shoulder-to-shoulder tape
• Double-needled hems
• Preshrunk to minimize shrinkage

Important: This product is available in Australia and New Zealand only. If your shipping address is outside this region, please choose a different product.
-----
Product ID: 582
Name: None
Description: To do list: feel comfy and look stylish at the same time. Mark both tasks as done with the unisex organic raglan sweatshirt. Its brushed fleece lining will make you feel like you’re being hugged by a cloud of softness . . . and the 100% cotton exterior will ensure a smooth feel on the outside.

• 100% organic cotton exterior
• Charcoal Melange’s exterior is 60% organic cotton, 40% recycled polyester
• 80% organic cotton, 20% recycled polyester interior
• 97% organic cotton, 3% elastane ribs
• Fabric weight: 8.3 oz/yd² (280 g/m²)
• Fabric weight for Charcoal Melange: 10.3 oz/yd² (348 g/m²)
• Side-seamed
• Raglan sleeves
• Neck tape
• Brushed fleece lining
• 2 × 2 ribbed cuffs, collar, and hem
• Blank product sourced from Pakistan

Disclaimer: US customers should order a size up as the EU sizes for this supplier correspond to a smaller size in the US market.
-----
Product ID: 734
Name: None
Description: Make a stylish statement wherever you go with this trendy oversized hoodie. It’s perfect for layering with a relaxed fit and made from extra soft premium-quality fabric to ensure maximum comfort.

• 80% cotton, 20% recycled polyester fleece
• Relaxed unisex fit
• Dropped shoulders
• Lined pullover hood with no drawcord
• Kangaroo pocket in front
• Sleeve cuff ribbing
• Blank product sourced from Vietnam

Disclaimer: The brushed interior of this hoodie tends to shed. To reduce visible traces of lint on clothes, avoid wearing dark colors under light-colored clothes and vice versa.
-----
Product ID: 748
Name: None
Description: Freshen up your wardrobe with this modern, premium long sleeve shirt. Its heavyweight fabric and relaxed fit ensure it’s not just any sweatshirt but your go-to for every occasion. Wrap yourself in the comfort of 100% carded cotton and make your everyday style look effortless.

• 100% carded cotton
• Fabric weight: 8.2 oz./yd.² (278 g/m²)
• Yarn diameter: 26 singles
• Relaxed fit
• Side-seamed construction
• Wide neck and cuff ribbing
• Double-needle stitch on hems
• Preshrunk to minimize shrinkage
• Blank product sourced from Bangladesh
-----
Product ID: 715
Name: None
Description: Made with 100% breathable polyester mesh, this unisex sports jersey provides optimal ventilation and comfort during intense workouts or leisure activities. The jersey’s relaxed fit and extended length offer extra 
coverage, while the binding on the collar ensures long-lasting durability and a polished look.

• 100% breathable polyester (mesh)
• Fabric weight: 4.13 oz./yd² (140 g/m²)
• Relaxed fit
• Elastic and durable
• Side-seamed construction
• Extended length
• Short raglan sleeves
• Binding on collar
• Classic round neckline
• Blank product sourced from China
-----
Product ID: 485
Name: None
Description: Every closet needs a long-lasting staple! This high-quality tee is made of 100% cotton and is extra durable thanks to its double-needle topstitch.

• 100% cotton
• Fabric weight: 5.6 oz/yd² (190 g/m²)
• Regular fit
• Shoulder-to-shoulder taping
• Double-needle topstitch on neck rib
• Blank product sourced from China

Important: This product is available in East Asia* only. If your shipping address is outside this region, please choose a different product.

*Japan, Hong Kong, Indonesia, South Korea, Malaysia, Philippines, Singapore, Thailand, Taiwan, Vietnam
-----
Product ID: 523
Name: None
Description: Create an effortless and relaxed look with the unisex french terry sweatshirt. The shirt is made of durable and soft French terry fabric, and has a classic, regular fit for maximum comfort.

• 100% cotton
• Fabric weight: 10.0 oz/yd² (339 g/m²)
• Regular fit
• Double-needle stitch on the collar ribs and sleeve cuffs
• Blank product sourced from China

Important: This product is available in East Asia* only. If your shipping address is outside this region, please choose a different product.

*Japan, Hong Kong, Indonesia, South Korea, Malaysia, Philippines, Singapore, Thailand, Taiwan, Vietnam
-----
Product ID: 521
Name: None
Description: The unisex french terry pullover hoodie combines comfort and style. The hoodie is made of French terry fabric that makes the garment elastic and soft. With its crisp, structured, and timeless look, the hoodie is bound to become a staple in your wardrobe.

• 100% cotton
• Fabric weight: 10.0 oz/yd² (339 g/m²)
• Regular fit
• Kangaroo pocket at the front
• Blank product sourced from China

Important: This product is available in East Asia* only. If your shipping address is outside this region, please choose a different product.

*Japan, Hong Kong, Indonesia, South Korea, Malaysia, Philippines, Singapore, Thailand, Taiwan, Vietnam
-----
Product ID: 538
Name: None
Description: Treat yourself to our comfy and durable oversized t-shirt. It’ll be a great base for your streetwear outfits and casual everyday wear. Plus, it’ll work well for layering too. Get yours now!

• Thick 100% cotton
• Mixed Grey is 90% cotton, 10% polyester
• Fabric weight: 5.6 oz/yd² (190 g/m²)
• Oversized fit
• Drop shoulder
• Durable and comfortable
• Blank product sourced from China

This product is available in East Asia* only. If your shipping address is outside this region, please choose a different product. 

*Japan, Hong Kong, Indonesia, South Korea, Malaysia, Philippines, Singapore, Thailand, Taiwan, Vietnam
-----
Product ID: 429
Name: None
Description: Good for a serious baseball training, as well as a rowdy backyard tumble, this youth baseball cap is sure to keep the sun out of your kid’s eyes. Featuring 6 eyelets for breathability and an adjustable strap, it offers a great fit, comfort, and a stylish design.

• 100% bio-washed chino cotton twill
• Head circumference: 21″–21.57″ (53.3 cm–54.8 cm)
• Unstructured, 6-panel, low-profile
• Pre-curved visor
• 6 embroidered eyelets
• Adjustable self-fabric hideaway strap closure
• Brass-toned tri-glide buckle
• Blank product sourced from Bangladesh
-----
Product ID: 662
Name: None
Description: Step up your style with an embroidered old-school cap. It’s crafted from 100% cotton corduroy that’s soft to the touch and comfy to wear. It features an adjustable strap with a gold-colored buckle for a great fit 
and a visor to protect you from the sun and wind. Complete your look with this embroidered corduroy cap and rock a cool vibe all day long.

• 100% cotton corduroy
• Unstructured, 6-panel, low-profile
• Cotton twill sweatband and taping
• 6 embroidered eyelets
• Adjustable strap with a gold-colored metal buckle
• Head circumference: 20″–22″ (50.8 cm–56 cm)
-----
Product ID: 694
Name: None
Description: Keep track of important dates in 2024 with a calendar that reflects your style and spirit! This stylish calendar not only helps you stay organized but also works as a decorative piece with unique artwork to go with each month.

• Paper pages bound with a silver-color metal wire
• Paper weight: 8 oz/yd² (271 g/m²)
-----
Product ID: 19
Name: None
Description: Whether you're drinking your morning coffee, evening tea, or something in between—this mug's for you! It's sturdy and glossy with a vivid print that'll withstand the microwave and dishwasher.

• Ceramic
• 11 oz mug dimensions: 3.8″ (9.6 cm) in height, 3.2″ (8.2 cm) in diameter
• 15 oz mug dimensions: 4.7″ (11.9 cm) in height, 3.3″ (8.5 cm) in diameter
• 20 oz mug dimensions: 4.3″ (10.9 cm) in height, 3.7″ (9.3 cm) in diameter
• Dishwasher and microwave safe
• Blank product sourced from China
-----
Product ID: 632
Name: None
Description: What’s an outdoor party without a wine tumbler to keep a drink fresh and at just the right temperature? Forget breakable glasses—give this uniquely shaped wine tumbler a chance and have fun with friends without worry.

• 12 oz (355 ml)
• Tumbler size: 4.7″ × 3.5″  (12 cm × 9 cm)
• High grade stainless steel
• Double-wall vacuum seal
• Curved, unique shape
-----
Product ID: 658
Name: None
Description: Boost your mood throughout your busy day with comfy and lightweight athletic shoes. Equipped with breathable lining, a padded collar, and rubber outsole—they’ll easily become your go-to footwear.

• 100% polyester ultralight flyknit
• Ethylene-vinyl acetate (EVA) rubber outsole
• Breathable lining
• Soft insole and a padded collar
• Lace-up front
• Blank product sourced from China

Disclaimer: A strong glue smell is expected upon the product’s arrival. Allow the shoes to air out for a couple of days and the smell will disappear.
-----
Product ID: 467
Name: None
Description: The women's fitted tee is a must-have. It's high-quality, super comfortable, and has form-fitting qualities. Best of all, it's made of 100% organic ring-spun combed cotton, making it an eco-friendly choice!       

• 100% organic ring-spun combed cotton
• Fabric weight: 4.57 oz/yd² (155 g/m²)
• Single jersey
• Set-in sleeves
• 1×1 rib at collar
• Narrow double-needle topstitch on the sleeves and bottom hems
• Self-fabric neck tape (inside, back of the neck)
• Blank product sourced from Bangladesh
-----
Product ID: 525
Name: None
Description: Don’t forget to treat your feet with care! The classic, stylish high top canvas shoes will be a great addition to your wardrobe.

• 100% polyester canvas upper side
• Ethylene-vinyl acetate (EVA) rubber outsole
• Breathable lining, soft insole
• Faux leather toe cap
• Padded collar, lace-up front
• Blank product sourced from China

Important: This product is available in the following countries: United States, Canada, Australia, United Kingdom, New Zealand, Japan, Austria, Andorra, Belgium, Bulgaria, Croatia, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Holy See (Vatican city), Hungary, Iceland, Ireland, Italy, Latvia, Lithuania, Liechtenstein, Luxemburg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Switzerland, 
Spain, Sweden, and Turkey. If your shipping address is outside these countries, please choose a different product.

Disclaimer: The shoes will have a glue-like smell when opening the box. The smell will disappear a few days after the shoes are unpacked.
-----
Product ID: 666
Name: None
Description: Made of 100% combed and ring-spun cotton, this t-shirt is ultra soft and smooth against the skin. With its flattering, longline fit and crew neck, this tee will look best paired with high-waisted bottoms.

• 100% combed and ring-spun cotton
• Fabric weight: 4.3 oz/yd² (145.79 g/m²)
• Yarn thickness: 30 singles
• Longline fit with a crew neck
• Blind stitch on sleeves and hem
• Tightly knit and side-seamed
• Ultra soft hand feel
• Tear-away label
• Blank product sourced from Bangladesh
-----
Product ID: 579
Name: None
Description: No closet is complete without a pair of sneakers. Step up your shoe game with these women’s lace-up canvas shoes and rest assured that your outfit will be polished to perfection.

• 100% polyester canvas upper side
• Ethylene-vinyl acetate (EVA) rubber outsole
• Breathable lining
• Padded collar and tongue
• Removable insole
• White laces
• Blank product sourced from China

Important: This product is available in the following countries: United States, Canada, Australia, United Kingdom, New Zealand, Japan, Austria, Andorra, Belgium, Bulgaria, Croatia, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Holy See (Vatican city), Hungary, Iceland, Ireland, Italy, Latvia, Lithuania, Liechtenstein, Luxemburg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Switzerland, 
Spain, Sweden, and Turkey. If your shipping address is outside these countries, please choose a different product.
-----
Product ID: 664
Name: None
Description: Casual and comfy to wear, this women’s polo shirt is a timeless addition to your closet. Made from textured pique fabric, it’s durable and breathable. This shirt is semi-fitted and has matching buttons for a touch of elegance. With a classic placket and collar, it’s suitable for both informal and professional occasions.

• 100% ringspun cotton
• The color Sport Grey is 90% cotton, 10% polyester
• Fabric weight: 5.2 oz./yd.² (176 g/m²)
• Semi-fitted
• Side-seamed construction
• Placket with dyed-to-match buttons
-----
Product ID: 782
Name: None
Description: Embrace ultimate comfort with this women’s V-neck t-shirt. Its soft fabric and relaxed fit make it ideal for a polished everyday look, with the V-neck adding a touch of style.

• Heather colors are 52% airlume combed and ring-spun cotton and 48% polyester
• Fabric weight: 4.2 oz./yd.² (142.4 g/m²)
• Yarn diameter: 32 singles
• Soft fabric
• Relaxed fit
• V-neck
• Side-seamed construction
• Blank product sourced from Nicaragua
-----
Product ID: 598
Name: None
Description: A must-have for the summer: these women’s slides. A pair of these will keep you comfy throughout your day of beach or pool activities, thanks to the cushioned upper strap and the textured footbed.

• Cushioned and durable faux leather upper strap
• Lightweight polyurethane (PU) outsole
• Contoured, textured footbed
• Stitched around the upper perimeter for extra durability
• Spot clean only
• Printed, cut, and handmade
• Blank product sourced from China

Important: This product is available in the following countries: United States, Canada, Australia, United Kingdom, New Zealand, Japan, Austria, Andorra, Belgium, Bulgaria, Croatia, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Holy See (Vatican city), Hungary, Iceland, Ireland, Italy, Latvia, Lithuania, Liechtenstein, Luxemburg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Switzerland, 
Spain, Sweden, and Turkey. If your shipping address is outside these countries, please choose a different product.

Disclaimer: The shoes will have a glue-like smell when opening the box. The smell will disappear a few days after the shoes are unpacked.
-----
Product ID: 575
Name: None
Description: Made for comfort and ease, these Women’s Slip-On Canvas Shoes are stylish and the ideal piece for completing an outfit. Equipped with removable soft insoles and rubber outsoles, it’s also easy to adjust them for a better fit.

•  100% polyester canvas upper side
•  Ethylene-vinyl acetate (EVA) rubber outsole
•  Your brand on the box, insole, and tongue of the shoe
•  Breathable lining, soft insole
•  Elastic side accents
•  Padded collar and tongue
•  Printed, cut, and handmade
•  Blank product sourced from China

Important: This product is available in the following countries: United States, Canada, Australia, United Kingdom, New Zealand, Japan, Austria, Andorra, Belgium, Bulgaria, Croatia, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Holy See (Vatican city), Hungary, Iceland, Ireland, Italy, Latvia, Lithuania, Liechtenstein, Luxemburg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Switzerland, 
Spain, Sweden, and Turkey. If your shipping address is outside these countries, please choose a different product.
-----
Product ID: 634
Name: None
Description: Add a cozy vibe to your home with these double-sided wooden ornaments. Made from Hinoki wood, they’re durable yet lightweight and soft to the touch.

• Material: solid, natural Hinoki wood
• Ornament thickness 0.37″ (9 mm)
• Comes with a red paper ribbon and a hole to thread it through
• Magnetic back
• Two-sided print
• Product sourced from Korea

Important: This product cannot be shipped to South Korea, Hong Kong, Taiwan, Japan, or Singapore. If your shipping address is in these regions, please choose a different product.
-----
Product ID: 706
Name: None
Description: Wrap your gifts in style with these premium wrapping paper sheets! Get three high-quality, matte-finished sheets and add a touch of elegance to birthdays, anniversaries, and other celebrations.

• Size: 28.75″ × 19.75″ (73 × 50.2 cm)
• Thickness: 70# uncoated text
• Printing on one side
• White reverse side
• A set of 3 sheets
• Matte finish
• Blank product sourced from the United States
-----
Product ID: 675
Name: None
Description: Whether you’re exercising, stretching, or meditating, it’s worth having a yoga mat that brings you joy and matches your style. It’s easy to carry and provides both stability and comfort with anti-slip rubber on the bottom and soft microsuede on top.

• Rubber mat with a microsuede top
• Anti-slip rubber bottom
• Size: 24″ × 68″ (61 cm × 173 cm)
• Weight: 62 oz. (1.75 kg)
• Mat thickness: 0.12″ (3 mm)
• Product sourced from China
-----
Product ID: 677
Name: None
Description: Cozy and cool, this youth crewneck sweatshirt is designed for every adventure. Made from soft fleece fabric, it’s easy to wear and hassle-free to wash. Whether headed out or snuggled up on the couch, the younger crowd will love the look and feel of this sweatshirt.

• 50% cotton, 50% polyester
• Fabric weight: 8 oz/yd² (271.25 g/m²)
• Air-jetted fleece fabric
• Regular fit
• Double-needle stitching on shoulders, armholes, neck, waistband, and cuffs
• The fabric is OEKO-TEX Standard 100 certified
-----
Product ID: 266
Name: None
Description: A snug, form-fitting beanie. It's not only a great head-warming piece but a staple accessory in anyone's wardrobe.

• 100% Turbo Acrylic
• 12″ (30 cm) in length
• Hypoallergenic 
• Unisex style
• Hand washable
• Blank product sourced from Vietnam, Bangladesh or the Republic of Korea
-----
Product ID: 100
Name: None
Description: Classic trucker cap style with a cool fabric blend.

• 47% cotton, 28% nylon, 25% polyester
• Structured, five-panel, high profile
• Flat bill
• Snapback closure
• Head circumference: 21⅝″–23⅝″ (53.3 cm–58.4 cm)
• Blank product sourced from Vietnam or Bangladesh
-----
Product ID: 91
Name: None
Description: The high-profile fit and a green undervisor make this cap a classic with an added pop of color.

• 100% cotton twill
• Structured
• Five panel
• High profile
• Green undervisor
• Sewn eyelets
• Snapback closure
-----
Product ID: 99
Name: None
Description: This hat is structured with a classic fit, flat brim, and full buckram. The adjustable snap closure makes it a comfortable, one-size-fits-most hat.

• 80% acrylic, 20% wool
• Green Camo is 60% cotton, 40% polyester
• Structured, 6-panel, high-profile
• 6 embroidered eyelets
• Plastic snap closure
• Green undervisor
• Head circumference: 21⅝″–23⅝″ (54.9 cm–60 cm)
• Blank product sourced from Vietnam or Bangladesh
-----
Product ID: 252
Name: None
Description: This six-panel trucker cap with a mesh back will be a comfy and classic choice for a perfect day in the sun.

• 60% cotton, 40% polyester
• Mid-profile cap with a low-profile embroidery area
• Structured, six-panel cap
• 3.5″ crown (8.9 cm)
• Hard buckram front panels
• Mesh back
• Permacurv® visor, matching undervisor
• Plastic adjustable closure
• Head circumference: 21⅝″–23⅝″ (54.9 cm–60 cm)
• Blank product sourced from Vietnam or Bangladesh
-----
Product ID: 92
Name: None
Description: This camper style cap has a low profile and nylon strap clip closure. Comfortable and classic!

• 100% cotton
• Soft-structured
• Five panel
• Low profile
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
Description: Dad hats aren't just for dads. This one's got a low profile with an adjustable strap and curved visor.

• 100% chino cotton twill
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
Description: Dad hats aren't just for dads. This one's got a low profile with an adjustable strap and curved visor.

• 100% chino cotton twill
• Green Camo color is 35% chino cotton twill, 65% polyester
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
Description: Dad hats aren't just for dads. This one's got a low profile with an adjustable strap and curved visor.

• 100% chino cotton twill
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
Description: Dad hats aren't just for dads. This one's got a low profile with an adjustable strap and curved visor.

• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
Description: Dad hats aren't just for dads. This one's got a low profile with an adjustable strap and curved visor.
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
• Metal eyelets
• Nylon strap clip closure
-----
• Metal eyelets
• Metal eyelets
• Metal eyelets
• Nylon strap clip closure
-----
• Metal eyelets
• Nylon strap clip closure
• Metal eyelets
• Nylon strap clip closure
• Metal eyelets
• Metal eyelets
• Metal eyelets
• Nylon strap clip closure
-----
Product ID: 206
Name: None
Description: Dad hats aren't just for dads. This one's got a low profile with an adjustable strap and curved visor.

• 100% chino cotton twill
• Green Camo color is 35% chino cotton twill, 65% polyester
• Unstructured, 6-panel, low-profile
• 6 embroidered eyelets
• 3 ⅛” (7.6 cm) crown
• Adjustable strap with antique buckle
• Blank product sourced from Vietnam or Bangladesh
-----
